{
  "hadith": [
    {
      "id": 0,
      "text": "The Prophet (ﷺ) said: 'Do not waste water, even if you are by a flowing river.' [Al-Bukhari]"
    },
    {
      "id": 1,
      "text": "The Prophet (ﷺ) said: 'Do not boycott your brother for more than three days. Whoever meets first with salām, his sin is forgiven.' [Al-Bukhari]"
    },
    {
      "id": 2,
      "text": "The Prophet (ﷺ) said: 'He who has in his heart an ant’s weight of arrogance will not enter Paradise.' [Muslim]"
    },
    {
      "id": 3,
      "text": "The Prophet (ﷺ) said: 'Whoever helps ease one in difficulty, Allāh will make it easy for him in this world and the Hereafter.' [Muslim]"
    },
    {
      "id": 4,
      "text": "The Prophet (ﷺ) said: 'He is not one of us who does not show mercy to our young.' [Al-Tirmidhi]"
    },
    {
      "id": 5,
      "text": "The Prophet (ﷺ) said: 'He is not one of us who does not show respect to our elders.' [Al-Tirmidhi]"
    },
    {
      "id": 6,
      "text": "The Prophet (ﷺ) said: 'Every one of you is a shepherd and is responsible for his flock.' [Al-Bukhari & Muslim]"
    },
    {
      "id": 7,
      "text": "The Prophet (ﷺ) said: 'Follow up a bad deed with a good deed; it wipes it out.' [Al-Tirmidhi]"
    },
    {
      "id": 8,
      "text": "The Prophet (ﷺ) said: 'Verily, the servant does not entirely have faith until he abandons lying even while joking.' [Ahmad]"
    },
    {
      "id": 9,
      "text": "The Prophet (ﷺ) was asked: 'Which deed is the best?' He said: 'Salat in the beginning of its time.' [Al-Bukhari]"
    },
    {
      "id": 10,
      "text": "The Prophet (ﷺ) said: 'Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' [Abu Dawud]"
    },
    {
      "id": 11,
      "text": "The Prophet (ﷺ) said: 'Every one of you is a shepherd and is responsible for his flock.' [Al-Bukhari & Muslim]"
    },
    {
      "id": 12,
      "text": "The Prophet (ﷺ) said: 'Follow up a bad deed with a good deed; it wipes it out.' [Al-Tirmidhi]"
    },
    {
      "id": 13,
      "text": "The Prophet (ﷺ) said: 'Verily, the servant does not entirely have faith until he abandons lying even while joking.' [Ahmad]"
    },
    {
      "id": 14,
      "text": "The Prophet (ﷺ) was asked: 'Which deed is the best?' He said: 'Salat in the beginning of its time.' [Al-Bukhari]"
    },
    {
      "id": 15,
      "text": "The Prophet (ﷺ) said: 'Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' [Abu Dawud]"
    },
    {
      "id": 16,
      "text": "The Prophet (ﷺ) said: 'Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' [Abu Dawud]"
    },
    {
      "id": 17,
      "text": "The Prophet (ﷺ) said: 'He is not one of us who does not show mercy to our young.' [Al-Tirmidhi]"
    },
    {
      "id": 18,
      "text": "The Prophet (ﷺ) said: 'He is not one of us who does not show respect to our elders.' [Al-Tirmidhi]"
    },
    {
      "id": 19,
      "text": "The Prophet (ﷺ) said: 'Every one of you is a shepherd and is responsible for his flock.' [Al-Bukhari & Muslim]"
    },
    {
      "id": 20,
      "text": "The Prophet (ﷺ) said: 'Follow up a bad deed with a good deed; it wipes it out.' [Al-Tirmidhi]"
    },
    {
      "id": 21,
      "text": "The Prophet (ﷺ) said: 'Verily, the servant does not entirely have faith until he abandons lying even while joking.' [Ahmad]"
    },
    {
      "id": 22,
      "text": "The Prophet (ﷺ) was asked: 'Which deed is the best?' He said: 'Salat in the beginning of its time.' [Al-Bukhari]"
    },
    {
      "id": 23,
      "text": "The Prophet (ﷺ) said: 'Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' [Abu Dawud]"
    },
    {
      "id": 24,
      "text": "The Prophet (ﷺ) said: 'Every one of you is a shepherd and is responsible for his flock.' [Al-Bukhari & Muslim]"
    },
    {
      "id": 25,
      "text": "The Prophet (ﷺ) said: 'Follow up a bad deed with a good deed; it wipes it out.' [Al-Tirmidhi]"
    },
    {
      "id": 26,
      "text": "The Prophet (ﷺ) said: 'Verily, the servant does not entirely have faith until he abandons lying even while joking.' [Ahmad]"
    },
    {
      "id": 27,
      "text": "The Prophet (ﷺ) was asked: 'Which deed is the best?' He said: 'Salat in the beginning of its time.' [Al-Bukhari]"
    },
    {
      "id": 28,
      "text": "The Prophet (ﷺ) said: 'Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' [Abu Dawud]"
    }
  ],


  "stories": [
    {
      "title": "The Flowing River",
      "text": "<p>Amir and Amirah were very excited for their weekend trip with their parents. They were going camping near a beautiful, flowing river. The air was fresh, the sky was bright, and the sound of water rushing over rocks filled the place with peace. When they arrived, both children ran down to the riverbank. 'SubhanAllah, it’s so clear!' Amirah exclaimed. Amir scooped some water into his hands, splashing it on his face and giggling. Their father reminded them gently, 'Children, this river is a blessing from Allah. We must always remember to treat it with care.'</p><p>Later, as Maghrib approached, Amir went to make wudu. He thought, 'Since there’s so much water here, I can use as much as I want.' He began pouring water over his arms again and again, splashing more than necessary. Amirah noticed and frowned. 'Amir, don’t waste water! Remember the Prophet ﷺ said: Do not waste water, even if you are by a flowing river.'</p><p>Amir stopped, feeling guilty. 'Astaghfirullah, you’re right.' He realized that even abundant blessings should not be wasted. That evening, their mother explained, 'Many people in the world struggle every day just to find clean water. Wasting what Allah has given us shows ingratitude.'</p><p>The next day, when washing dishes by the river, Amirah used only what was needed, and Amir followed her example. Their father smiled, saying, 'MashaAllah, you are honoring Allah’s blessings.' As they packed up to leave, Amir whispered, 'Alhamdulillah for water. I’ll never waste it again.'</p><p>They left with a new appreciation: no matter how endless a blessing seems, it must always be treated with gratitude and respect.</p>",
      "hadithIndex": 0
    },
    {
      "title": "The Forgiving Heart",
      "text": "<p>At school, Hasan and Bilal had a disagreement while playing soccer. Both boys became upset and decided not to speak to each other. One day turned into two, then three, and neither wanted to be the first to apologize. Their friends noticed and felt sad because the two were always together. On the fourth morning, Bilal sat quietly in class, feeling uneasy. He remembered what their teacher once said about the Prophet ﷺ’s words: 'Do not boycott your brother for more than three days. Whoever meets first with salam, his sin is forgiven.'</p><p>Bilal thought hard. He missed playing with Hasan. He also knew that holding anger in his heart was heavy. After school, he saw Hasan standing by the gate. Gathering courage, Bilal walked up and said softly, 'As-salamu alaykum.' Hasan’s eyes brightened. 'Wa alaykum as-salam,' he replied warmly. Both boys smiled, and suddenly the heaviness in their hearts disappeared. They hugged, each realizing how much they had missed their friendship.</p><p>The next day, they were back on the soccer field, playing together happily. Their teacher, who saw them, said, 'MashaAllah, you learned a beautiful lesson. Islam teaches us that anger and grudges only hurt us. Forgiving each other and greeting with salam brings peace and wipes away sins.'</p><p>From that day, Hasan and Bilal promised not to let small arguments ruin their friendship again. They learned that taking the first step toward reconciliation is a sign of strength, not weakness, and a way to earn Allah’s forgiveness.</p>",
      "hadithIndex": 1
    },
    {
      "title": "The Tiny Seed of Arrogance",
      "text": "<p>Amir loved studying, and one day he came first in his class exam. His parents were proud, and his teacher praised him in front of everyone. Amir felt so happy that he began looking down on his classmates. When Hasan struggled to answer a question, Amir smirked and whispered to Amirah, 'He’ll never be as smart as me.' Amirah frowned. 'Amir, that’s not nice.' But Amir brushed it off, feeling superior. Over the next week, Amir started to act arrogantly, always showing off his high marks and refusing to help others.</p><p>One afternoon, Teacher Fatima noticed his attitude. She called him aside and asked gently, 'Amir, do you know what the Prophet ﷺ said? He said: He who has in his heart an ant’s weight of arrogance will not enter Paradise.' Amir’s eyes widened. 'Not even a tiny bit?' She nodded. 'Yes, arrogance makes us forget that all success comes from Allah, not from ourselves.'</p><p>That evening, Amir thought deeply. He remembered how Hasan had once shared his lunch with him when he forgot his own, and how Amirah always helped him revise. He realized he had no reason to think he was better than others. Feeling ashamed, he prayed, 'O Allah, forgive me. Everything I have is from You.'</p><p>The next day, he went to Hasan and said, 'I’m sorry for being rude. Will you let me help you with your homework?' Hasan smiled, 'Of course, my friend.' Amir learned that true honor comes from humility, not arrogance. From then on, he tried to be humble and grateful, knowing that arrogance only closes the doors to Paradise.</p>",
      "hadithIndex": 2
    },

     {
      "title": "The Helping Hand",
      "text": "<p>Amirah was walking home from school when she saw an elderly woman struggling to carry heavy grocery bags. The woman stopped often, resting on a bench, her face showing exhaustion. Amirah hesitated for a moment, then remembered what her father always told her: 'Whoever helps ease one in difficulty, Allah will make it easy for him in this world and the Hereafter.' Amirah ran to the woman and said politely, 'Assalamu alaykum, Auntie. Can I help you carry your bags?' The woman smiled with relief, 'Wa alaykum salam, dear child. JazakAllahu khayran, yes please.'</p><p>Amirah carried the bags alongside her. They talked about school, the woman’s grandchildren, and how kindness makes the world brighter. When they reached her home, the woman made du’a for Amirah: 'May Allah bless you and ease all your difficulties.' Amirah felt her heart glow. That evening, when her father heard what she had done, he smiled proudly. 'MashaAllah, my daughter. Remember, whenever you help someone in difficulty, Allah helps you even more.'</p><p>Amirah realized that the small act of carrying groceries was actually very big in Allah’s eyes. She understood that kindness is not measured by size, but by intention and sincerity. From that day, she looked for opportunities to ease others’ burdens — helping her mother in the kitchen, carrying her sister’s books, and even comforting a sad classmate. Each time, she whispered, 'O Allah, ease my path as I ease theirs.'</p>",
      "hadithIndex": 3
    },
    {
      "title": "Mercy for the Young",
      "text": "<p>One sunny afternoon, Amir and Amirah were playing outside with their little sister, Layla. Layla was still learning how to kick a ball, but Amir grew impatient when she kept missing. 'You’re too small to play with us!' he shouted. Layla’s eyes filled with tears. Amirah quickly went to her and hugged her. 'Don’t cry, Layla. You’re doing great.' Amir frowned, but Amirah reminded him gently, 'The Prophet ﷺ said: He is not one of us who does not show mercy to our young.'</p><p>Amir’s face softened. He realized he had hurt his sister’s feelings. He picked up the ball and handed it to Layla. 'I’m sorry. Come, I’ll show you how to kick it properly.' With patience, Amir guided her step by step. Layla laughed when she finally managed to kick the ball a little distance. 'I did it!' she shouted joyfully. Their mother, watching from the window, smiled and said, 'MashaAllah, that’s how an older brother should be — kind and merciful.'</p><p>From then on, Amir learned to be gentler with his younger sister. He realized that showing mercy was not weakness but strength. Layla looked up to him even more, and their bond grew stronger. Amir understood that the Prophet ﷺ’s guidance was not just words, but a way to fill homes and hearts with love and mercy.</p>",
      "hadithIndex": 4
    },
    {
      "title": "Respecting the Elders",
      "text": "<p>Hasan loved visiting the masjid with his father. One day, he saw an elderly man slowly walking with a cane. The man struggled to remove his shoes at the entrance. Some boys laughed at how long he was taking. Hasan felt uncomfortable. He hurried over and said, 'Assalamu alaykum, Uncle. Let me help you.' He carefully placed the man’s shoes on the rack and guided him inside. The man smiled, 'Wa alaykum salam, my son. JazakAllahu khayran.' Later, Hasan’s father praised him, 'The Prophet ﷺ said: He is not one of us who does not respect our elders.'</p><p>After salah, the imam gave a short reminder. He explained how respecting elders is part of faith — offering them seats, speaking gently, listening to their advice, and never mocking their weakness. Hasan felt proud that he had acted rightly. On the way home, he promised himself that he would always be gentle with older people, remembering that one day, he too would grow old. Respecting elders, he realized, is not just kindness, but a way to honor Allah’s blessings in those who came before us.</p>",
      "hadithIndex": 5
    },
    {
      "title": "The Trust of Responsibility",
      "text": "<p>At school, Teacher Fatima gave the class an important task: each student had to take care of a small plant for two weeks. Amirah received a tiny pot with a sprouting seed. She watered it daily, made sure it had sunlight, and even spoke to it gently. Amir, however, forgot about his plant. When Teacher Fatima checked, Amirah’s plant had grown green leaves, while Amir’s had withered. 'Every one of you is a shepherd and is responsible for his flock,' the teacher reminded them. 'This plant was your flock.' Amir felt ashamed. He realized responsibility means caring for what is entrusted to us — family, friends, belongings, or even pets.</p><p>That evening, he told his parents what happened. His father said, 'We are all shepherds in different ways. I am responsible for this family, and you are responsible for your actions.' Amir promised to do better. He started helping around the house, feeding the cat, and being more mindful in salah. Slowly, he learned that responsibility is not a burden but an honor. Being a shepherd means protecting, guiding, and caring — just as the Prophet ﷺ taught.</p>",
      "hadithIndex": 6
    },
    {
      "title": "Turning Mistakes into Good",
      "text": "<p>One afternoon, Bilal accidentally broke his friend’s pencil. Instead of apologizing, he laughed and said, 'It’s just a pencil!' His friend looked upset and walked away. Bilal felt uneasy. Later, he remembered the hadith: 'Follow up a bad deed with a good deed; it wipes it out.' Bilal realized he had done wrong. The next day, he brought a new pencil and gave it to his friend. 'I’m sorry about yesterday,' he said. His friend’s face brightened, 'Thank you, Bilal!' The anger between them disappeared.</p><p>That evening, Bilal told his mother what he had done. She smiled, 'MashaAllah. Everyone makes mistakes, but the best people are those who fix them with good deeds.' Bilal learned that sins and mistakes can be wiped away not just by saying sorry, but also by doing good afterwards. From that day, whenever he made a mistake, he quickly tried to replace it with kindness. He understood that no one is perfect, but Islam gives us a way to turn errors into blessings by following up with good deeds.</p>",
      "hadithIndex": 7
    },
    {
      "title": "The Joke That Went Too Far",
      "text": "<p>During recess, Amir thought it would be funny to trick his friends. He told Hasan, 'Your backpack is missing!' Hasan panicked and ran around searching, only to find it exactly where he left it. Amir laughed loudly. But Hasan was not amused. Teacher Fatima overheard and said gently, 'Amir, lying is never allowed, even as a joke. The Prophet ﷺ said: Verily, the servant does not entirely have faith until he abandons lying even while joking.'</p><p>Amir’s laughter faded. He realized that while he thought it was harmless fun, it had caused Hasan stress. That evening, Amir apologized, 'I won’t lie in jokes again.' Hasan forgave him, and they played happily. Amir learned that honesty is part of faith, and humor should never come at the cost of truth. From then on, his jokes were filled with kindness and laughter — without lies. He discovered that true joy is in honesty, not in tricks.</p>",
      "hadithIndex": 8
    },
    {
      "title": "The Best Deed",
      "text": "<p>It was Fajr time. The adhan echoed through the neighborhood, but Amir wanted to stay in bed. His father gently called, 'Amir, prayer is better than sleep.' Reluctantly, Amir got up and prayed, but he delayed other prayers throughout the day. Later, Teacher Fatima explained in class: 'The Prophet ﷺ was asked: Which deed is the best? He said: Salat in the beginning of its time.' Amir thought about it deeply. The next day, when the adhan was called, he rushed to make wudu and stood ready for salah. He felt peaceful finishing prayer at its start. His father smiled, 'MashaAllah, you are learning to love salah.' Over time, Amir began to pray every salah at its beginning, finding barakah in his day. He learned that honoring salah brings strength, peace, and Allah’s pleasure.</p>",
      "hadithIndex": 9
    },
    {
      "title": "The Silent Winner",
      "text": "<p>At recess, Bilal and Hasan argued about who kicked the ball first. Their voices grew louder, each trying to prove he was right. Amirah walked over and said, 'Brothers, remember the hadith: Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' Bilal paused. Even though he knew he was correct, he decided to stay quiet. Hasan, surprised, stopped too. Amirah smiled, 'See? By not arguing, you both win.' Later, Bilal felt a lightness in his heart. He realized that being right is not as important as keeping peace. From then on, whenever he was tempted to argue, he remembered that real victory lies in humility and silence for Allah’s sake.</p>",
      "hadithIndex": 10
    },
    {
      "title": "The Best Deed",
      "text": "<p>It was Fajr time. The adhan echoed through the neighborhood, but Amir wanted to stay in bed. His father gently called, 'Amir, prayer is better than sleep.' Reluctantly, Amir got up and prayed, but he delayed other prayers throughout the day. Later, Teacher Fatima explained in class: 'The Prophet ﷺ was asked: Which deed is the best? He said: Salat in the beginning of its time.' Amir thought about it deeply. The next day, when the adhan was called, he rushed to make wudu and stood ready for salah. He felt peaceful finishing prayer at its start. His father smiled, 'MashaAllah, you are learning to love salah.' Over time, Amir began to pray every salah at its beginning, finding barakah in his day. He learned that honoring salah brings strength, peace, and Allah’s pleasure.</p>",
      "hadithIndex": 11
    },
    {
      "title": "The Silent Winner",
      "text": "<p>At recess, Bilal and Hasan argued about who kicked the ball first. Their voices grew louder, each trying to prove he was right. Amirah walked over and said, 'Brothers, remember the hadith: Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' Bilal paused. Even though he knew he was correct, he decided to stay quiet. Hasan, surprised, stopped too. Amirah smiled, 'See? By not arguing, you both win.' Later, Bilal felt a lightness in his heart. He realized that being right is not as important as keeping peace. From then on, whenever he was tempted to argue, he remembered that real victory lies in humility and silence for Allah’s sake.</p>",
      "hadithIndex": 12
    },
    {
      "title": "The Best Deed",
      "text": "<p>It was Fajr time. The adhan echoed through the neighborhood, but Amir wanted to stay in bed. His father gently called, 'Amir, prayer is better than sleep.' Reluctantly, Amir got up and prayed, but he delayed other prayers throughout the day. Later, Teacher Fatima explained in class: 'The Prophet ﷺ was asked: Which deed is the best? He said: Salat in the beginning of its time.' Amir thought about it deeply. The next day, when the adhan was called, he rushed to make wudu and stood ready for salah. He felt peaceful finishing prayer at its start. His father smiled, 'MashaAllah, you are learning to love salah.' Over time, Amir began to pray every salah at its beginning, finding barakah in his day. He learned that honoring salah brings strength, peace, and Allah’s pleasure.</p>",
      "hadithIndex": 13
    },
    {
      "title": "The Silent Winner",
      "text": "<p>At recess, Bilal and Hasan argued about who kicked the ball first. Their voices grew louder, each trying to prove he was right. Amirah walked over and said, 'Brothers, remember the hadith: Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' Bilal paused. Even though he knew he was correct, he decided to stay quiet. Hasan, surprised, stopped too. Amirah smiled, 'See? By not arguing, you both win.' Later, Bilal felt a lightness in his heart. He realized that being right is not as important as keeping peace. From then on, whenever he was tempted to argue, he remembered that real victory lies in humility and silence for Allah’s sake.</p>",
      "hadithIndex": 14
    },
    {
      "title": "The Best Deed",
      "text": "<p>It was Fajr time. The adhan echoed through the neighborhood, but Amir wanted to stay in bed. His father gently called, 'Amir, prayer is better than sleep.' Reluctantly, Amir got up and prayed, but he delayed other prayers throughout the day. Later, Teacher Fatima explained in class: 'The Prophet ﷺ was asked: Which deed is the best? He said: Salat in the beginning of its time.' Amir thought about it deeply. The next day, when the adhan was called, he rushed to make wudu and stood ready for salah. He felt peaceful finishing prayer at its start. His father smiled, 'MashaAllah, you are learning to love salah.' Over time, Amir began to pray every salah at its beginning, finding barakah in his day. He learned that honoring salah brings strength, peace, and Allah’s pleasure.</p>",
      "hadithIndex": 15
    },
    {
      "title": "The Silent Winner",
      "text": "<p>At recess, Bilal and Hasan argued about who kicked the ball first. Their voices grew louder, each trying to prove he was right. Amirah walked over and said, 'Brothers, remember the hadith: Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' Bilal paused. Even though he knew he was correct, he decided to stay quiet. Hasan, surprised, stopped too. Amirah smiled, 'See? By not arguing, you both win.' Later, Bilal felt a lightness in his heart. He realized that being right is not as important as keeping peace. From then on, whenever he was tempted to argue, he remembered that real victory lies in humility and silence for Allah’s sake.</p>",
      "hadithIndex": 16
    },
    {
      "title": "The Silent Winner",
      "text": "<p>At recess, Bilal and Hasan argued about who kicked the ball first. Their voices grew louder, each trying to prove he was right. Amirah walked over and said, 'Brothers, remember the hadith: Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' Bilal paused. Even though he knew he was correct, he decided to stay quiet. Hasan, surprised, stopped too. Amirah smiled, 'See? By not arguing, you both win.' Later, Bilal felt a lightness in his heart. He realized that being right is not as important as keeping peace. From then on, whenever he was tempted to argue, he remembered that real victory lies in humility and silence for Allah’s sake.</p>",
      "hadithIndex": 17
    },
    {
      "title": "The Best Deed",
      "text": "<p>It was Fajr time. The adhan echoed through the neighborhood, but Amir wanted to stay in bed. His father gently called, 'Amir, prayer is better than sleep.' Reluctantly, Amir got up and prayed, but he delayed other prayers throughout the day. Later, Teacher Fatima explained in class: 'The Prophet ﷺ was asked: Which deed is the best? He said: Salat in the beginning of its time.' Amir thought about it deeply. The next day, when the adhan was called, he rushed to make wudu and stood ready for salah. He felt peaceful finishing prayer at its start. His father smiled, 'MashaAllah, you are learning to love salah.' Over time, Amir began to pray every salah at its beginning, finding barakah in his day. He learned that honoring salah brings strength, peace, and Allah’s pleasure.</p>",
      "hadithIndex": 18
    },
    {
      "title": "The Silent Winner",
      "text": "<p>At recess, Bilal and Hasan argued about who kicked the ball first. Their voices grew louder, each trying to prove he was right. Amirah walked over and said, 'Brothers, remember the hadith: Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' Bilal paused. Even though he knew he was correct, he decided to stay quiet. Hasan, surprised, stopped too. Amirah smiled, 'See? By not arguing, you both win.' Later, Bilal felt a lightness in his heart. He realized that being right is not as important as keeping peace. From then on, whenever he was tempted to argue, he remembered that real victory lies in humility and silence for Allah’s sake.</p>",
      "hadithIndex": 19
    },
    {
      "title": "The Best Deed",
      "text": "<p>It was Fajr time. The adhan echoed through the neighborhood, but Amir wanted to stay in bed. His father gently called, 'Amir, prayer is better than sleep.' Reluctantly, Amir got up and prayed, but he delayed other prayers throughout the day. Later, Teacher Fatima explained in class: 'The Prophet ﷺ was asked: Which deed is the best? He said: Salat in the beginning of its time.' Amir thought about it deeply. The next day, when the adhan was called, he rushed to make wudu and stood ready for salah. He felt peaceful finishing prayer at its start. His father smiled, 'MashaAllah, you are learning to love salah.' Over time, Amir began to pray every salah at its beginning, finding barakah in his day. He learned that honoring salah brings strength, peace, and Allah’s pleasure.</p>",
      "hadithIndex": 20
    },
    {
      "title": "The Silent Winner",
      "text": "<p>At recess, Bilal and Hasan argued about who kicked the ball first. Their voices grew louder, each trying to prove he was right. Amirah walked over and said, 'Brothers, remember the hadith: Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' Bilal paused. Even though he knew he was correct, he decided to stay quiet. Hasan, surprised, stopped too. Amirah smiled, 'See? By not arguing, you both win.' Later, Bilal felt a lightness in his heart. He realized that being right is not as important as keeping peace. From then on, whenever he was tempted to argue, he remembered that real victory lies in humility and silence for Allah’s sake.</p>",
      "hadithIndex": 21
    },
    {
      "title": "The Best Deed",
      "text": "<p>It was Fajr time. The adhan echoed through the neighborhood, but Amir wanted to stay in bed. His father gently called, 'Amir, prayer is better than sleep.' Reluctantly, Amir got up and prayed, but he delayed other prayers throughout the day. Later, Teacher Fatima explained in class: 'The Prophet ﷺ was asked: Which deed is the best? He said: Salat in the beginning of its time.' Amir thought about it deeply. The next day, when the adhan was called, he rushed to make wudu and stood ready for salah. He felt peaceful finishing prayer at its start. His father smiled, 'MashaAllah, you are learning to love salah.' Over time, Amir began to pray every salah at its beginning, finding barakah in his day. He learned that honoring salah brings strength, peace, and Allah’s pleasure.</p>",
      "hadithIndex": 22
    },
    {
      "title": "The Silent Winner",
      "text": "<p>At recess, Bilal and Hasan argued about who kicked the ball first. Their voices grew louder, each trying to prove he was right. Amirah walked over and said, 'Brothers, remember the hadith: Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' Bilal paused. Even though he knew he was correct, he decided to stay quiet. Hasan, surprised, stopped too. Amirah smiled, 'See? By not arguing, you both win.' Later, Bilal felt a lightness in his heart. He realized that being right is not as important as keeping peace. From then on, whenever he was tempted to argue, he remembered that real victory lies in humility and silence for Allah’s sake.</p>",
      "hadithIndex": 23
    },
    {
      "title": "The Silent Winner",
      "text": "<p>At recess, Bilal and Hasan argued about who kicked the ball first. Their voices grew louder, each trying to prove he was right. Amirah walked over and said, 'Brothers, remember the hadith: Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' Bilal paused. Even though he knew he was correct, he decided to stay quiet. Hasan, surprised, stopped too. Amirah smiled, 'See? By not arguing, you both win.' Later, Bilal felt a lightness in his heart. He realized that being right is not as important as keeping peace. From then on, whenever he was tempted to argue, he remembered that real victory lies in humility and silence for Allah’s sake.</p>",
      "hadithIndex": 24
    },
    {
      "title": "The Best Deed",
      "text": "<p>It was Fajr time. The adhan echoed through the neighborhood, but Amir wanted to stay in bed. His father gently called, 'Amir, prayer is better than sleep.' Reluctantly, Amir got up and prayed, but he delayed other prayers throughout the day. Later, Teacher Fatima explained in class: 'The Prophet ﷺ was asked: Which deed is the best? He said: Salat in the beginning of its time.' Amir thought about it deeply. The next day, when the adhan was called, he rushed to make wudu and stood ready for salah. He felt peaceful finishing prayer at its start. His father smiled, 'MashaAllah, you are learning to love salah.' Over time, Amir began to pray every salah at its beginning, finding barakah in his day. He learned that honoring salah brings strength, peace, and Allah’s pleasure.</p>",
      "hadithIndex": 25
    },
    {
      "title": "The Silent Winner",
      "text": "<p>At recess, Bilal and Hasan argued about who kicked the ball first. Their voices grew louder, each trying to prove he was right. Amirah walked over and said, 'Brothers, remember the hadith: Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' Bilal paused. Even though he knew he was correct, he decided to stay quiet. Hasan, surprised, stopped too. Amirah smiled, 'See? By not arguing, you both win.' Later, Bilal felt a lightness in his heart. He realized that being right is not as important as keeping peace. From then on, whenever he was tempted to argue, he remembered that real victory lies in humility and silence for Allah’s sake.</p>",
      "hadithIndex": 26
    },
    {
      "title": "The Best Deed",
      "text": "<p>It was Fajr time. The adhan echoed through the neighborhood, but Amir wanted to stay in bed. His father gently called, 'Amir, prayer is better than sleep.' Reluctantly, Amir got up and prayed, but he delayed other prayers throughout the day. Later, Teacher Fatima explained in class: 'The Prophet ﷺ was asked: Which deed is the best? He said: Salat in the beginning of its time.' Amir thought about it deeply. The next day, when the adhan was called, he rushed to make wudu and stood ready for salah. He felt peaceful finishing prayer at its start. His father smiled, 'MashaAllah, you are learning to love salah.' Over time, Amir began to pray every salah at its beginning, finding barakah in his day. He learned that honoring salah brings strength, peace, and Allah’s pleasure.</p>",
      "hadithIndex": 27
    },
    {
      "title": "The Silent Winner",
      "text": "<p>At recess, Bilal and Hasan argued about who kicked the ball first. Their voices grew louder, each trying to prove he was right. Amirah walked over and said, 'Brothers, remember the hadith: Verily, the servant does not entirely have faith until he abandons arguing even if he is truthful.' Bilal paused. Even though he knew he was correct, he decided to stay quiet. Hasan, surprised, stopped too. Amirah smiled, 'See? By not arguing, you both win.' Later, Bilal felt a lightness in his heart. He realized that being right is not as important as keeping peace. From then on, whenever he was tempted to argue, he remembered that real victory lies in humility and silence for Allah’s sake.</p>",
      "hadithIndex": 28
    }
  
  ]
}
